In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['dev', 'aditya', 'Nishu', 'Sudheer'],
    "marks":['90', '90', '70', '60'],
    "city":['Morna', 'Morna', 'Morna', 'Morna']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      name marks   city
0      dev    90  Morna
1   aditya    90  Morna
2    Nishu    70  Morna
3  Sudheer    60  Morna

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv', index=False)

In [7]:
df.head(2)

     name marks   city
0     dev    90  Morna
1  aditya    90  Morna

In [8]:
df.tail(2)

      name marks   city
2    Nishu    70  Morna
3  Sudheer    60  Morna

In [9]:
df.describe()

       name marks   city
count     4     4      4
unique    4     3      1
top     dev    90  Morna
freq      1     2      4

In [10]:
dev = pd.read_csv('dev.csv', index_col=[0])

In [11]:
dev

   Train No  Speed     City
0     12345     50  Dhampur
1     12322     23  Dhampur
2    123211     43  Dhampur
3     12121     54  Dhampur

In [12]:
dev['Speed'][0]=50

C:\Users\welcome\AppData\Local\Temp\ipykernel_8632\1763496690.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dev['Speed'][0]=50

In [13]:
dev

   Train No  Speed     City
0     12345     50  Dhampur
1     12322     23  Dhampur
2    123211     43  Dhampur
3     12121     54  Dhampur

In [14]:
dev.to_csv('dev.csv')

In [15]:
dev.index = ['first', 'second', 'third', 'forth']

In [16]:
dev

        Train No  Speed     City
first      12345     50  Dhampur
second     12322     23  Dhampur
third     123211     43  Dhampur
forth      12121     54  Dhampur

In [17]:
dev

        Train No  Speed     City
first      12345     50  Dhampur
second     12322     23  Dhampur
third     123211     43  Dhampur
forth      12121     54  Dhampur

In [18]:
dev.loc[['first'], :]

       Train No  Speed     City
first     12345     50  Dhampur

In [19]:
dev.drop(['first', 'third'], axis=0, inplace=True)

In [20]:
dev

        Train No  Speed     City
second     12322     23  Dhampur
forth      12121     54  Dhampur

In [23]:
dev.reset_index(drop=True, inplace=True)

In [24]:
dev.head(3)

   Train No  Speed     City
0     12322     23  Dhampur
1     12121     54  Dhampur